scripts/mutants/replace-all-noop.patch
diff --git a/crates/lst-editor/src/command.rs b/crates/lst-editor/src/command.rs
--- a/crates/lst-editor/src/command.rs
+++ b/crates/lst-editor/src/command.rs
@@ -218,9 +218,7 @@ impl EditorModel {
             ReplaceCurrentMatch => {
                 self.replace_one();
             }
-            ReplaceAllMatches => {
-                self.replace_all_matches();
-            }
+            ReplaceAllMatches => {}
             ToggleFindCaseSensitive => {
                 self.find.case_sensitive = !self.find.case_sensitive;
                 self.reindex_find_matches_to_nearest();
